In [1]:
import pandas as pd

# Groupby

In [2]:
data = {
    'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'sales': [200,120,340,124,243,350]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [5]:
groupedby_company = df.groupby('company')

In [6]:
groupedby_company.sum()

             person  sales
company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [7]:
groupedby_company.min()

          person  sales
company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [8]:
groupedby_company.max()

          person  sales
company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [15]:
groupedby_company.describe().std()

sales  count     0.000000
       mean     68.284332
       std      50.913325
       min      69.888006
       25%      66.704729
       50%      68.284332
       75%      74.323757
       max      83.864971
dtype: float64

In [9]:
groupedby_company.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [10]:
groupedby_company.describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [21]:
df.describe().corr()

       sales
sales    1.0

In [17]:
!pip install matplotlib

Requirement already satisfied: matplotlib in /home/abdullah/dev_env/lib/python3.10/site-packages (3.9.2)
Requirement already satisfied: contourpy>=1.0.1 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (1.3.0)
Requirement already satisfied: cycler>=0.10 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: python-dateutil>=2.7 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: numpy>=1.23 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (2.1.2)
Requirement already satisfied: fonttools>=4.22.0 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (4.54.1)
Requirement already satisfied: packaging>=20.0 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (24.1)
Requirement already satisfied: kiwisolver>=1.3.1 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (1.4.7)
Requirement already satisfied: pillow>=8 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (11.0.0)
Requirement already satisfied: pyparsing>=2.3.1 in /home/abdullah/dev_env/lib/python3.10/site-packages (from matplotlib) (3.2.0)
Requirement already satisfied: six>=1.5 in /home/abdullah/dev_env/lib/python3.10/site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)

In [19]:
!pip install scikit-learn

Collecting scikit-learn
  Downloading scikit_learn-1.5.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (13.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 13.3/13.3 MB 930.1 kB/s eta 0:00:00m eta 0:00:0136m0:00:01
Collecting scipy>=1.6.0
  Downloading scipy-1.14.1-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (41.2 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 41.2/41.2 MB 3.6 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01m
Collecting threadpoolctl>=3.1.0
  Downloading threadpoolctl-3.5.0-py3-none-any.whl (18 kB)
Collecting joblib>=1.2.0
  Downloading joblib-1.4.2-py3-none-any.whl (301 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 301.8/301.8 KB 2.0 MB/s eta 0:00:00[36m0:00:01[36m0:00:01
Requirement already satisfied: numpy>=1.19.5 in /home/abdullah/dev_env/lib/python3.10/site-packages (from scikit-learn) (2.1.2)
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn
Successfully installed joblib-1.4.2 scikit-learn-1.5.2 scipy-1.14.1 threadpoolctl-3.5.0